// Строгий режим
"use strict"
// код

// Задача №1
// Що потрапить в консоль ?
// let someVar = 0;
// ++someVar;

// if (someVar) {
// 	console.log(someVar);
// }
//Відповідь--1


// Задача №2
// За допомогою циклу FOR виведіть в консоль 10 рядків:
// Пункт №1
// Пункт №2
// і т.д.

// let line = 10
// for (let i = 0; i <= line; ++i) {
// 	console.log(`Пункт №${++i}`)
// }


// Задача №3
// Що потрапить в консоль ?
// if (2 * 20 <= 10 || 30 / 2 < 5 && 10 <= "10" || 20 === "20") {
// 	console.log('000');
// }

// 1) (40 <= 10(ні) або 15 < 5(ні)) та ... всеодно вже умови не виконуются тому в консолі нічного не буде


// Задача №4
// Створіть функцію, яка повертає результат ділення числа a на число b з додаванням рядка "Результат ділення: "
// Викличте функцію передаючі різні значення, у тому числі не передаючи зовсім.
// Функція не має повертати NaN, Infinite або помилку

// let Calc
// function calcNumber(a, b) {
// 	Calc = a / b
// 	if (a && b) {
// 		console.log(`Результат ділення: ${Calc}`)
// 	} else {
// 		console.log(`Перевірте правильність вводу`)
// 	}
// }
// calcNumber(9, 3)
// calcNumber()
// calcNumber(1, 0)


// Задача №5
// Створіть масив даних - 5 елементів, один з яких число 10
// Обробіть масив за допомогою методу перебору
// Перевіряйте елемент на відповідність числу 10, та у разі відповідності, виводьте в консоль

// let blok = ['google', 28, Infinity, 10, 'js']
// blok.forEach(value => {
// 	if (value === 10) {
// 		console.log(value)
// 	}
// });